InformationRegisters/ПараметрыОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыОбменСБанками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследняяДатаПолученияЭД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЖурналирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогДляЖурналирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоматическоеПолучениеВыписки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолученияВыписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСообщенийВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяSMSАвторизация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SMSАвторизацияОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеСтандартнойНастройкиВыписки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеПромежуточнойВыписки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеИтоговойВыписки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолученияИтоговойВыписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьОтсутствующиеЭлементы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыОбменСБанками/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль менеджера РегистрСведений.ПараметрыОбменСБанками
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПереходНаСтандартнуюНастройкуАвтоматическойЗагрузкиВыписки");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПереходНаСтандартнуюНастройкуАвтоматическойЗагрузкиВыписки() Экспорт
	
	ПериодПовтораВТечениеДня = 3600;
	РегламентноеЗаданиеИспользуется = Истина;
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		МинимальныйПериодПовтораВТечениеДня = 600;
		РегламентноеЗаданиеИспользуется = Ложь;
		КаждыйДень = 1;
		ОтборЗадания = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.УдалитьПолучениеВыпискиОбменСБанками);
		Задания = РегламентныеЗаданияСервер.НайтиЗадания(ОтборЗадания);
		Для каждого Задание Из Задания Цикл
			Если Задание.Использование Тогда
				РегламентноеЗаданиеИспользуется = Истина;
				ПараметрыЗадания = Новый Структура();
				ПараметрыЗадания.Вставить("Использование", Ложь);
				РегламентныеЗаданияСервер.ИзменитьЗадание(Задание.УникальныйИдентификатор, ПараметрыЗадания);
				
				ПериодПовтораВТечениеДняИзЗадания = Задание.Расписание.ПериодПовтораВТечениеДня;
				Если Задание.Расписание.ПериодПовтораДней = КаждыйДень 
					И ПериодПовтораВТечениеДняИзЗадания < ПериодПовтораВТечениеДня
					И ПериодПовтораВТечениеДняИзЗадания > МинимальныйПериодПовтораВТечениеДня Тогда
					
					ПериодПовтораВТечениеДня = ПериодПовтораВТечениеДняИзЗадания;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПараметрыОбменСБанками.НастройкаОбмена КАК НастройкаОбмена
	|ИЗ
	|	РегистрСведений.ПараметрыОбменСБанками КАК ПараметрыОбменСБанками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанками
	|		ПО ПараметрыОбменСБанками.НастройкаОбмена = НастройкиОбменСБанками.Ссылка
	|ГДЕ
	|	ПараметрыОбменСБанками.АвтоматическоеПолучениеВыписки
	|	И ПараметрыОбменСБанками.РегламентноеЗаданиеСтандартнойНастройкиВыписки = &ПустойИдентификатор
	|	И ПараметрыОбменСБанками.РегламентноеЗаданиеПромежуточнойВыписки = &ПустойИдентификатор
	|	И ПараметрыОбменСБанками.РегламентноеЗаданиеИтоговойВыписки = &ПустойИдентификатор";
	
	Запрос.УстановитьПараметр("ПустойИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			Если РегламентноеЗаданиеИспользуется Тогда
				НастройкиЗадания = ОбменСБанкамиСлужебный.НовыеНастройкиЗаданияАвтоматическойВыписки(
					Выборка.НастройкаОбмена, "Стандартные");
				НастройкиЗадания.СтандартнаяВыпискаПериодПовтора = ПериодПовтораВТечениеДня;
			Иначе
				НастройкиЗадания = ОбменСБанкамиСлужебный.НовыеНастройкиЗаданияАвтоматическойВыписки(
					Выборка.НастройкаОбмена, "БезНастроек");
			КонецЕсли;
			ОбменСБанкамиСлужебный.УстановитьНастройкиЗаданияАвтоматическойВыписки(НастройкиЗадания);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Операция = НСтр("ru = 'Обновление подсистемы прямого обмена с банками'");
			ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = НСтр("ru = 'При обновлении подсистемы прямого обмена с банками произошла ошибка'");
			ОбменСБанкамиСлужебный.ОбработатьОшибку(Операция, ПодробныйТекстОшибки, ТекстСообщения);
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сохраняет параметры обмена с банками в регистр ПараметрыОбменСБанками
//
// Параметры:
//  НастройкаОбмена - СправочникСсылка.НастройкиОбменСБанками - настройка обмена с банком.
//	Параметры - Структура - сохраняемые параметры.
//
Процедура СохранитьЗначенияПараметровОбмена(НастройкаОбмена, Параметры) Экспорт

	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НастройкаОбмена = НастройкаОбмена;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.НастройкаОбмена = НастройкаОбмена;
	
	Для Каждого Параметр Из Параметры Цикл
		
		МенеджерЗаписи[Параметр.Ключ] = Параметр.Значение;
		
	КонецЦикла;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры

// Читает параметры обмена с банками из регистра ПараметрыОбменСБанками
//
// Параметры:
//  НастройкаОбмена - СправочникСсылка.НастройкиОбменСБанками - настройка обмена с банком.
//	Параметры - Структура - структура с именами ключей необходимых параметров.
//
Процедура ПрочитатьЗначенияПараметровОбмена(НастройкаОбмена, Параметры) Экспорт
	
	ТекстЗапросаПолей = "";
	
	Для Каждого Поле Из Параметры Цикл
		ТекстЗапросаПолей = 
			ТекстЗапросаПолей + ?(ПустаяСтрока(ТекстЗапросаПолей), "", ",") +
			"	" + Поле.Ключ + " КАК " + Поле.Ключ;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ИменаПолей
	|ИЗ
	|	РегистрСведений.ПараметрыОбменСБанками КАК ПараметрыОбменСБанками
	|ГДЕ
	|	ПараметрыОбменСБанками.НастройкаОбмена = &НастройкаОбмена";
	
	Запрос = Новый Запрос(СтрЗаменить(ТекстЗапроса, "&ИменаПолей", ТекстЗапросаПолей));
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Параметры, Выборка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
